Revit 2026 API

# RebarContainerItemFindMatchingPredefinedPresentationMode Method

---

Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarPresentationMode FindMatchingPredefinedPresentationMode(
	View dBView
)
```
```vb
Public Function FindMatchingPredefinedPresentationMode (
	dBView As View
) As RebarPresentationMode
```
```cpp
public:
RebarPresentationMode FindMatchingPredefinedPresentationMode(
	View^ dBView
)
```
```fsharp
member FindMatchingPredefinedPresentationMode :
        dBView : View -> RebarPresentationMode
```

#### Parameters

dBView View
     The view.

#### Return Value

RebarPresentationMode The presentation mode that matches the current set of selected hidden and unhidden bars. If there is no better match, this returns RebarPresentationMode.Select.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the presentation mode is not PresentationMode.Select for the view, this function returns the current mode.

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace